#Использовать ".."
#Использовать asserts

Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;

	МассивФайлов = НайтиФайлы(КаталогФикстур(), "*.md", Ложь);
	Для каждого Файл из МассивФайлов Цикл
		юТест.ДобавитьТест("ТестДолжен_ПроверитьПреобразование", Новый Структура("Имя", Файл.ИмяБезРасширения));
	КонецЦикла;

КонецФункции

Процедура ТестДолжен_ПроверитьПреобразование(СтруктураПараметров) Экспорт

	ИсходныйТекстМаркдаун = ПолучитьСодержимоеФайла(ОбъединитьПути(КаталогФикстур(), СтруктураПараметров.Имя + ".md"));
	ЭталоныйТекстХтмл = ПолучитьСодержимоеФайла(ОбъединитьПути(КаталогФикстур(), СтруктураПараметров.Имя + ".html"));

	Маркдаун = Новый Markdown;
	ТекстХтмл = Маркдаун.Преобразовать(ИсходныйТекстМаркдаун);

	Ожидаем.Что(ТекстХтмл).Равно(ЭталоныйТекстХтмл);

КонецПроцедуры

Функция КаталогФикстур()
	Возврат ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures"); 
КонецФункции

Функция ПолучитьСодержимоеФайла(ПутьКФайлу)
	Читатель = Новый ЧтениеТекста;
	Читатель.Открыть(ПутьКФайлу);
	Содержимое = Читатель.Прочитать();
	Читатель.Закрыть();
	Возврат Содержимое;
КонецФункции