#Использовать ".."
#Использовать asserts

Перем юТест;

Перем Маркдаун;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;

	юТест.ДобавитьТест("ТестДолжен_ПроверитьРаботуСокрЛПРасш", Новый Структура("ИсходнаяСтрока,ЧтоСокращать,Результат", "  А  ", "", "А"));
	юТест.ДобавитьТест("ТестДолжен_ПроверитьРаботуСокрЛПРасш", Новый Структура("ИсходнаяСтрока,ЧтоСокращать,Результат", "  А  ", "", "А"));
	юТест.ДобавитьТест("ТестДолжен_ПроверитьРаботуСокрЛПРасш", Новый Структура("ИсходнаяСтрока,ЧтоСокращать,Результат", "	А", "", "А"));
	юТест.ДобавитьТест("ТестДолжен_ПроверитьРаботуСокрЛПРасш", Новый Структура("ИсходнаяСтрока,ЧтоСокращать,Результат", "А", "", "А"));

	юТест.ДобавитьТест("ТестДолжен_ПроверитьРаботуСокрЛПРасш", Новый Структура("ИсходнаяСтрока,ЧтоСокращать,Результат", "А", "А", ""));

	юТест.ДобавитьТест("ТестДолжен_ПроверитьРаботуСокрЛПРасш", Новый Структура("ИсходнаяСтрока,ЧтоСокращать,Результат", "фйцукенф", "ф", "йцукен"));
	юТест.ДобавитьТест("ТестДолжен_ПроверитьРаботуСокрЛПРасш", Новый Структура("ИсходнаяСтрока,ЧтоСокращать,Результат", "фйцукен", "ф", "йцукен"));
	юТест.ДобавитьТест("ТестДолжен_ПроверитьРаботуСокрЛПРасш", Новый Структура("ИсходнаяСтрока,ЧтоСокращать,Результат", "ффффйцукен", "ф", "йцукен"));
	юТест.ДобавитьТест("ТестДолжен_ПроверитьРаботуСокрЛПРасш", Новый Структура("ИсходнаяСтрока,ЧтоСокращать,Результат", "йцукен", "ф", "йцукен"));

	юТест.ДобавитьТест("ТестДолжен_ПроверитьРаботуСокрЛПРасш", Новый Структура("ИсходнаяСтрока,ЧтоСокращать,Результат", "123А123", "123", "А"));
	юТест.ДобавитьТест("ТестДолжен_ПроверитьРаботуСокрЛПРасш", Новый Структура("ИсходнаяСтрока,ЧтоСокращать,Результат", "22223А", "123", "А"));
	юТест.ДобавитьТест("ТестДолжен_ПроверитьРаботуСокрЛПРасш", Новый Структура("ИсходнаяСтрока,ЧтоСокращать,Результат", "123А123123", "123", "А"));
	юТест.ДобавитьТест("ТестДолжен_ПроверитьРаботуСокрЛПРасш", Новый Структура("ИсходнаяСтрока,ЧтоСокращать,Результат", "А123", "123", "А"));
	юТест.ДобавитьТест("ТестДолжен_ПроверитьРаботуСокрЛПРасш", Новый Структура("ИсходнаяСтрока,ЧтоСокращать,Результат", "123А123234", "123", "А123234"));

	юТест.ДобавитьТест("ТестДолжен_ПроверитьРаботуСокрЛПРасш", Новый Структура("ИсходнаяСтрока,ЧтоСокращать,Результат", "123А123234", "!", "123А123234"));

КонецФункции

Процедура ТестДолжен_ПроверитьРаботуСокрЛПРасш(СтруктураПараметров) Экспорт

	Маркдаун = Новый Markdown;
	Результат = Маркдаун.СокрЛПРасш(СтруктураПараметров.ИсходнаяСтрока, СтруктураПараметров.ЧтоСокращать);
	Ожидаем.Что(Результат).Равно(СтруктураПараметров.Результат);

КонецПроцедуры